/*******************FOOD***************/

let aliments = {
      "name":[
         "oeufs",
         "poivrons",
         "pomme",
         "banane",
         "chocolat",
         "citron",
         "fromage",
         "pâtes",
         "pain",
         "riz",
         "raisin",
         "orange",
         "concombre",
         "viande hachée",
         "tomate",
         "salade",
         "carotte",
         "radis",
         "pizza",
         "hamburger",
         "poisson",
         "fraise",
         "broccoli",
         "poire",
         "ananas",
         "poulet",
         "oignon"
      ],

      "description":[
         "Sa grandeur varie en fonction de l'animal qui l'a pondu. Par exemple un œuf d'autruche sera plus grand qu'un œuf de poule et un œuf de colibri fera seulement quelques millimètres !",
         "Le poivron est le fruit d'une plante annuelle de la même espèce que les piments. La plante en question produit des poivrons jaunes, oranges, rouges et verts. Le poivron désigne la fruit et la plante en même temps, et on le considère comme un légume.",
         "La pomme est un fruit qu on peut trouver sur les pommiers,on peut la manger en tarte,en charlotte,en compote,en salades de fruits et on peut la boire en jus.",
         "La banane est le fruit exotique du bananier. Derrière sa peau épaisse, la banane renferme une pulpe blanc ivoire plus ou moins sucrée selon les variétés. Jaune ou verte, elle possède une forme allongée et légèrement incurvée. Elle est facile à transporter grâce à sa protection naturelle, facile à éplucher et à manger partout (elle ne rend pas de jus), mais aussi facile à mettre au menu de toute la famille, dans la mesure où elle peut être introduite dans l’alimentation dès 5-6 mois. L’en-cas parfait du goûter !",
         "Le chocolat est un aliment que l'on fabrique à partir de fèves de cacao (graines du cacaoyer). Le chocolat est très souvent consommé, seul et souvent par plaisir, ou alors utilisé dans différentes recettes de cuisine. Les meilleurs chocolats du monde, en tout cas les plus réputés, sont ceux de Suisse (où on a inventé le chocolat au lait) et ceux de Belgique. En verite on dit que le chocolat est bon pour la santée, mais on dit aussi que non.",
         "Le citron est un agrume. Il existe en jaune et en vert. C'est le fruit du citronnier qui peut avoir une hauteur de 5 à 10 mètres. Les citrons poussent dans beaucoup de pays chauds et donc par exemple dans tous les pays du sud de l'Europe.",
         "Le fromage (du latin forma, qui veut dire former) est un aliment élaboré avec du lait coagulé (solidifié) de vache, de chèvre, de brebis, de bufflonne ou de chamelle.",
         "Les pâtes alimentaires sont des aliments fabriqués à partir d'un mélange pétri de farine, de semoule de blé dur, d'épeautre, de blé noir, de riz ou d'autres types de céréales, d'eau et parfois d'œuf et de sel. « Les pâtes » peuvent également désigner les plats dont les pâtes sont l'ingrédient principal, servies avec de la sauce ou des assaisonnements. Elles présentent plusieurs variétés, selon la diversité des formes comme les nouilles, spaghetti, coquillettes, ou macaronis.",
         "Le pain est fabriqué dans des boulangeries, avec de la farine, de l'eau, de la levure et quelques fois des céréales comme le seigle. Le pain est cuit dans des fours spéciaux.",
         "Le riz est une céréale qui constitue l'aliment de base de nombreuses populations, notamment en Afrique et en Asie. Le riz se cultive le plus souvent dans des rizières inondées d'eau.",
         "Le raisin est un fruit comestible produit par un arbrisseau : le vigne. Le raisin se caractérise par plusieurs grains réparti sous forme de grappes dont la forme est le plus souvent sphérique. C'est un fruit très connue car c'est le deuxième fruit le plus cultivé (après l'orange) du monde. Le raisin est très sucré et existe sous différentes couleurs.",
         "L'orange est le fruit des orangers. Elle est très riche en vitamine C. L'orange est un agrume de couleur orange. Sa peau épaisse se découpe en morceaux, de la même façon que la mandarine. L'orange a été découverte il y a plus de 4000 ans, en Chine. Elle s'est fait connaître à l'époque des grandes découvertes par le Portugal. Elle se faisait rare à l'époque de Louis XIV.",
         "C'est botaniquement un légume. La plante, qui poussait naturellement au pied de l'Himalaya, aurait été domestiquée pour la première fois en Inde il y a au moins 3 000 ans.",
         "La viande est la chair des animaux terrestres, des oiseaux et des poissons, dont on se nourrit. La consommation de viande ou de certains types de viande est controversée et, dans diverses cultures et religions.",
         "La tomate est une des trois plantes comestibles les plus populaires au monde. On la consomme au moins dans un tiers des pays de la planète. Contrairement à ce que l'on pourrait croire, la tomate est un fruit et non un légume ! En effet elle comporte des graines elle est donc un fruit.",
         "La salade c'est delicieux, demande a ton papa de t'en cuisiner ptdr",
         "La plante peut atteindre 80 centimètres de haut. Sa racine, épaisse et allongée, est consommée comme légume, crue ou cuite.",
         "Le radis cultivé est probablement originaire d’Asie Mineure. Les premières cultures de radis auraient eu lieu en Mésopotamie et en Egypte il y a 4 000 ans. Le radis était dédié à Apollon par les Grecs. Il fait partie des plantes dont la culture est recommandée dans les domaines royaux par Charlemagne",
         "La pizza est un plat issu de la cuisine italienne. Elle est constitué d'une pâte, avec différentes garnitures comme par exemple des tomates, du fromage, des champignons, du jambon ou du salami, des olives, des poivrons, etc.",
         "Le hamburger est un sandwich garni de viande hachée, de crudités et de sauce. Il vient en réalité d'Hambourg, en Allemagne. On en trouve surtout dans les fast-food américains.",
         "Les poissons sont des animaux vertébrés aquatiques et poïkilothermes (à « sang froid »). Leur corps est souvent couvert d'écailles et possède des nageoires qui leur permettent de se déplacer dans l'eau. Ils respirent grâce à leurs branchies.",
         "La fraise est un fruit rouge avec ses petites graines beiges qui s'appellent les akènes. Elle a une tige verte.",
         "Le brocoli est un légume vert. C'est une variété de chou. Son origine se trouve dans le Sud de l'Italie.",
         "'La poire est le fruit du poirier. Sa couleur peut varier du jaune au brun, en passant par le vert et le rouge selon les variétés.",
         "L'ananas est une plante vivace de la famille des broméliacées, originaire d'Amérique du Sud. Le nom « ananas » vient du mot nanas, en tupi, une ancienne langue parlée par certaines tribus amérindiennes du Brésil.",
         "On nomme poulet le jeune, mâle ou femelle, de la poule. C'est donc le stade entre le poussin et la poule ou le coq. Le poulet sert principalement à notre consommation, par exemple comme poulet grillé.",
         "L'oignon (ou Ognon) est une plante herbacée. On récupère le bulbe de cette plante, et c'est ça que l'on consomme. Il est considéré comme un légume, mais aussi un condiment. En effet, on l'utilise pour assaisonner beaucoup de plats. Parmi les nombreuses variétés d'oignon, on trouve l'échalote. Si tu coupe un oignon, du gaz carbonique va sortir et ainsi faire piquer les yeux si nous sommes trop proche de celui ci. Ce n'est pas mortel."
      ],
      "questions":[
         "Est-ce que l'aliment est un fruit ?",
         "Est-ce que l'aliment est transformé ?",
         "Est-ce que ça pousse dans la terre ?",
         "Est-ce que l'aliment n'est pas vegan ?",
         "Est-ce que c'est un légume ?",
         "Est-ce que c'est un fruit à jus ?",
         "Est-ce que l'aliment a une peau ?",
         "Est-ce que c'est un féculent ?",
         "Est-ce que c'est un aliment riche en protéines ?",
         "Est-ce que l'aliment est sucré ?",
         "Est-ce que cet aliment pousse dans un arbre ?",
         "Est-ce que ça a une forme ronde ?",
         "Est-ce que l'aliment a des pépins ?",
         "Est-ce que ça a une couleur rouge ou jaune ?"
      ],
      "keyWords":[
         "fruit",
         "transformé",
         "pousse_terre",
         "pas_vegan",
         "legume",
         "jus",
         "peau",
         "féculent",
         "protéines",
         "sucré",
         "arbre",
         "rond",
         "pépins",
         "rouge_jaune",
      ],
      "descriptionKeyWords":[
        "pas_vegan rond protéines",
        "pousse_terre légume peau rouge_jaune",
        "fruit jus peau sucré arbre rond pépins rouge_jaune",
        "fruit peau sucré arbre rouge_jaune",
        "transformé sucré",
        "fruit jus peau arbre rond pépins rouge_jaune",
        "transformé pas_vegan protéines",
        "féculent rouge_jaune",
        "transformé féculent",
        "pousse_terre féculent",
        "fruit jus peau sucré arbre rond pépins",
        "fruit jus peau sucré arbre rond pépins",
        "pousse_terre légume peau",
        "transformé pas_vegan protéines",
        "fruit jus peau rond rouge_jaune",
        "pousse_terre légume",
        "pousse_terre légume peau",
        "pousse_terre légume",
        "transformé pas_vegan rond",
        "transformé pas_vegan",
        "pas_vegan peau protéines",
        "fruit jus sucré rouge_jaune",
        "pousse_terre légume",
        "fruit peau sucré pépins arbre",
        "fruit pousse_terre jus peau sucré",
        "pas_vegan peau protéine",
        "pousse_terre légume peau rond",
      ],
      "sources":[
         "../images/oeufs.svg",
         "../images/poivron.svg",
         "../images/pomme.svg",
         "../images/bananes.svg",
         "../images/chocolat.svg",
         "../images/citron.svg",
         "../images/fromage.svg",
         "../images/pates.svg",
         "../images/pain.svg",
         "../images/riz.svg",
         "../images/raisin.svg",
         "../images/orange.svg",
         "../images/concombre.svg",
         "../images/viande.svg",
         "../images/tomate.svg",
         "../images/salade.svg",
         "../images/carotte.svg",
         "../images/radis.svg",
         "../images/pizza.svg",
         "../images/hamburger.svg",
         "../images/poisson.svg",
         "../images/fraise.svg",
         "../images/broccoli.svg",
         "../images/poire.svg",
         "../images/ananas.svg",
         "../images/poulet.svg",
         "../images/oignon.svg"
      ],
}
/*******************ANIMALS***************/
let animals = {
      "name":[
        "chat",
        "cheval",
        "zèbre",
        "girafe",
        "souris",
        "mouton",
        "cochon",
        "vache",
        "poule",
        "éléphant",
        "ane",
        "poisson",
        "requin",
        "rhinocéros",
        "chien",
        "tortue",
        "renard",
        "chouette",
        "ours",
        "chèvre",
        "ecureuil",
        "abeille",
        "morse",
        "lapin",
        "lama",
        "dindon",
        "suricate",
      ],
      "description":[
        "Le chat possède l'organe de Jacobson qui est un « sixième sens » car il lui permet de goûter les odeurs. En retroussant les babines, il permet aux odeurs de remonter par deux petits orifices situés derrière leurs dents de devant. Les odeurs sont ensuite concentrées et absorbées.",
        "Le cheval est un grand mammifère herbivore et à sabot unique, appartenant aux espèces de la famille des Équidés. Il a évolué au cours des dernières 45 à 55 millions d'années, à partir d'un petit mammifère possédant plusieurs doigts. À l'état naturel, les chevaux vivent en troupeaux.",
        "Ces animaux se caractérisent par des bandes de rayures verticales noires et blanches. Ils se trouvent principalement en Afrique centrale et australe.Une légende africaine demande si le zèbre est blanc à rayures noires ou noir à rayures blanches. Cette question a généré de nombreuses légendes ou réponses fantaisistes, mais des explications plus scientifiques existent.",
        "La longueur moyenne de la langue d'une girafe est de 50 centimètres. Et elles peuvent s'en servir pour attraper ce qu'elles veulent ou se curer le nez.",
        "Une fois apprivoisée c'est un animal qui est apprécié également comme animal de compagnie très affectueux et intelligent. L'aspect culturel autour de la souris est extrêmement important. De nombreux proverbes, citations, livres, poèmes, chansons, films, dessins animés, etc. portent sur ce thème de la souris.",
        "Animal clé dans l'histoire de l'agriculture, le mouton a profondément marqué la culture humaine. Les moutons sont souvent associés aux scènes champêtres. Le mouton figure dans de nombreuses légendes, comme la Toison d'or et dans les grandes religions, en particulier les religions abrahamiques.",
        "Le cochon est une sous-espèce du sanglier sauvage. C'est un mammifère.Les cochons sont considérés comme plus intelligents que les chiens.On dit que le cochon grogne ou grouine",
        "La vache beugle, meugle ou mugit. Le poids moyen d'une vache adulte varie en fonction de la race de 500 à 900 kg. Elle est plus petite que le taureau.En Inde, une grande partie de la population considère traditionnellement les vaches comme des animaux sacrés. Elles sont libres de se promener dans les rues et jusque sur les autoroutes. Elles ne sont pas destinées à être mangées",
        "La poule caquette, glousse ou crételle. C'est un animal adapté à la course (trois doigts posés au sol), et volant peu.Les poules mangent des graines, de petits invertébrés comme des vers de terre, de l'herbe et de petits cailloux pour la digestion.",
        "Les éléphants sont les plus grands animaux terrestres vivant actuellement : l'éléphant d'Afrique mesure en moyenne 4 mètres de haut (à l'épaule) et pèse environ 6 tonnes. Ce sont des mammifères herbivores à la peau très épaisse. C'est pour cela qu'ils sont aussi appelés pachydermes, (pachy- signifiant épais en grec et -derme la peau). La femelle ne donne naissance qu'à un seul petit à la fois, après l'avoir gardé dans son ventre pendant 22 mois. Il entend très bien grâce à ses grandes oreilles, a un bon odorat avec sa trompe, mais la vue est assez faible avec ses petits yeux. Son cri s'appelle le barrissement.",
        "Son cri est le braiment : l'âne brait.Contrairement à ce qu'on pense, l'âne est bien plus intelligent que le cheval. Il possède des oreilles plus longues que celles du cheval. Il se contente de peu de nourriture et nécessite moins d'entretien que lui.Sa force et sa docilité en font un excellent allié de l'homme pour porter de lourds bâts ou tirer des charges. Un âne marche à environ 4 km/h (soit la vitesse d'un enfant). Un âne moyen peut porter jusqu'à 40 kg.",
        "Les poissons sont des animaux vertébrés aquatiques à branchies, pourvus de nageoires et dont le corps est le plus souvent couvert d'écailles. On les trouve abondamment aussi bien dans les eaux douces que dans les mers : on trouve des espèces depuis les sources de montagnes jusqu'au plus profond des océans.",
        "Lorsqu'un requin meurt, le sel de l'eau dissout son squelette : seules les dents perdurent et traversent les âges. En effet, le squelette d'un requin est entièrement composé de cartilage !",
        "Toutes les espèces de rhinocéros sont actuellement en voie de disparition.Les rhinocéros font localement l'objet d'une protection et de projets de réintroduction. Ils peuvent mesurer 4 m de longueur pour 1,50 m à 2 m de hauteur au garrot, et une masse pouvant avoisiner les 3 tonnes. Ce sont les plus gros mammifères terrestres actuels après l'éléphant. Les rhinocéros sont du même ordre que les chevaux et les tapirs, et non celui des éléphants. Leurs cris sont un barrissement, un grognement, un halètement.",
        "Le chien est la première espèce animale à avoir été domestiquée par l'Homme pour l'usage de la chasse dans une société humaine paléolithique qui ne maîtrise alors ni l'agriculture ni l'élevage.",
        "Les Tortues (Testudines), ou Chéloniens, forment un ordre de reptiles dont la caractéristique est d'avoir une carapace. Il existe une grande variété d'espèces possédant des caractéristiques diverses, mais toutes se distinguent des autres reptiles par cette carapace qui est constituée d'un plastron au niveau du ventre et d'une dossière sur le dessus.",
        "La symbolique du renard est vaste et associe généralement cet animal à la flatterie, au mensonge, à la malice et à la ruse. De nombreux peuples ont remarqué les mœurs rusées du renard et les traduisent de manières différentes dans leurs récits mythologiques.",
        "Les chouettes et hiboux alimentent différents mythes depuis des millénaires. C’était déjà le cas sous la Grèce antique, où ces animaux symbolisaient la sagesse, mais aussi la ville d’Athènes, ce qui leur valut d’orner les premières pièces de monnaie connues. Plus tard, les Romains attribueraient au hululement des volatiles l’annonce d’une mort prochaine et les associeraient à la sorcellerie et à la magie noire. Chez les Indiens d’Amérique du Nord, en revanche, on leur attribue le pouvoir d’octroyer aide et protection et leurs plumes sont employées dans les cérémonies rituelles.",
        "Si un jour vous vous retrouvez face à un ours, il ne faut pas s'enfuir en courant. Il vous prendrait pour une proie, vous attaquerait et vous rattraperait probablement puisque les ours peuvent courir jusqu'à 50km/h. La méthode la plus appropriée consiste à lui faire face, paraître le plus grand possible et s'éloigner calmement en marche arrière pour paraître dangereux sans sembler agressif. Si l'ours charge, il ne faut pas bouger (plus facile à dire qu'à faire) car cela est généralement du bluff.",
        "La chèvre est un animal d'assez petite taille, à cornes arquées ou sans cornes (motte), très agile, particulièrement adapté au saut. On la trouve dans toutes les régions du globe, particulièrement en montagne. Les mâles sont appelés boucs et les petits sont des chevreaux (parfois encore appelés cabris)",
        "La queue en panache de l'écureuil et son acharnement à faire des provisions pour l'hiver ont contribué à sa popularité et en ont fait un animal emblématique souvent présent dans la symbolique et la culture.",
        "L’abeille est un petit insecte volant qui est utilisé par les hommes pour produire notamment le miel et la cire.",
        "Le morse est parfaitement reconnaissable à ses défenses, ses moustaches drues et son allure massive. Les mâles adultes du Pacifique peuvent peser jusqu'à deux tonne. Le morse vit principalement dans les eaux peu profondes des plateaux continentaux, passant une part importante de son existence sur les blocs de glace ou les icebergs dérivant en mer. C'est un animal sociable, à l'espérance de vie d'environ 40 ans, et considéré comme une espèce clé des écosystèmes marins de l'Arctique.",
        "En présence d’un serpent à l’attaque, qui cherche à l’hypnotiser avant de frapper, le lapin se fige. Il sait instinctivement que le reptile ne peut distinguer un animal immobile d’un objet.",
        "Sa longévité est comprise entre 10 et 20 ans. Cri du lama : le lama s'exprime par toute une gamme de sons, qui peuvent traduire la tristesse, la mise en garde de ses congénères contre un danger supposé, l'hostilité vis-à-vis d'un rival. Le lama crache pour sa défense (très rarement sur l'homme, plus souvent sur ses congénères)",
        "Le dindon glougloute. Il est originaire d’Amérique et a été introduit en Espagne vers 1500, pour s’étendre ensuite dans toute l’Europe. En France, les premiers dindons ont été servis comme mets en 1570 aux noces du roi Charles IX.",
        "Sa tête et son corps mesurent de 245 à 290 millimètres, et sa queue de 190 à 240 millimètres. Le suricate mange entre autres des insectes, des souris, des rats, des oiseaux, des petits reptiles et des tubercules ou bulbes de plantes qu'il déterre avec ses pattes munies de fortes griffes non rétractiles de deux centimètres de longueur. Les suricates sont ainsi capables de déplacer leur propre poids de terre en 20 secondes. Une paupière transparente protège leurs yeux lorsqu'ils creusent le sable.",
      ],
      "questions":[
        "Est-ce qu’il vit dans le désert ?",
        "Est-ce qu’il vit dans l’eau ?",
        "Est-ce que c’est un animal domestique ?",
        "Est-ce qu’il vit dans le froid ?",
        "Est-ce un animal qui préfère la chaleur ?",
        "Est-ce un animal qui se mange ?",
        "Est-ce un animal qui pond des oeufs ?",
        "Est-ce un animal qui est chasseur ?",
        "Est-ce un animal carnivore ?",
        "Est-ce un animal qui a quatre pattes ?",
        "Est-ce un animal qui vole ?",
        "Est-ce un animal herbivore ?",
        "Est-ce que c’est un animal dangereux pour l’homme ?",
        "Est-ce que c’est un animal qui peut poser des problèmes de surpopulation ?",
      ],
      "keyWords":[
        "désert",
        "eau",
        "domestique",
        "froid",
        "chaleur",
        "mange",
        "oeufs",
        "chasseur",
        "carnivore",
        "quatre",
        "vole",
        "herbivore",
        "danger",
        "surpopulation",
      ],
      "descriptionKeyWords":[
        "domestique chasseur carnivore quatre",
        "domestique mange",
        "désert chaleur quatre herbivore",
        "désert chaleur quatre herbivore",
        "domestique",
        "mange quatre herbivore",
        "quatre carnivore",
        "domestique mange quatre herbivore",
        "mange oeufs surpopulation",
        "désert chaleur herbivore danger",
        "domestique chaleur quatre herbivore",
        "eau mange surpopulation",
        "eau chasseur carnivore danger",
        "désert quatre herbivore",
        "domestique chasseur carnivore quatre",
        "oeufs quatre",
        "chaleur chasseur carnivore quatre",
        "vole oeufs",
        "danger quatre",
        "mange quatre",
        "quatre",
        "chaleur vole danger",
        "eau froid carnivore",
        "domestique mange quatre surpopulation",
        "domestique chaleur quatre",
        "mange oeufs",
        "désert chasseur carnivore quatre",
        ],
      "sources":[
        "../images/chat.svg",
        "../images/cheval.svg",
        "../images/zebre.svg",
        "../images/giraffe.svg",
        "../images/souris.svg",
        "../images/mouton.svg",
        "../images/cochon.svg",
        "../images/vache.svg",
        "../images/poule.svg",
        "../images/elephant.svg",
        "../images/ane.svg",
        "../images/poisson_2.svg",
        "../images/requin.svg",
        "../images/rhino.svg",
        "../images/chien.svg",
        "../images/tortue.svg",
        "../images/renard.svg",
        "../images/chouette.svg",
        "../images/ours.svg",
        "../images/chevre.svg",
        "../images/ecureuil.svg",
        "../images/abeille.svg",
        "../images/morse.svg",
        "../images/lapin.svg",
        "../images/lama.svg",
        "../images/dindon.svg",
        "../images/surricate.svg"
        ],
}

/*******************KINGS***************/

let kings = {
      "name":[
        "Clovis (481 - 511)",
        "Dagobert Ier (623 - 639)",
        "Henri Ier (1031 - 1060)",
        "Charles X (1824 - 1830)",
        "Henri IV “le Grand” (1589 - 1610)",
        "Philippe IV “le Bel” (1285 - 1314)",
        "Louis XVI “le martyr” (1774 - 1792)",
        "Louis XIV “le Roi-Soleil” (1643 - 1715)",
        "Charlemagne “empereur d’occident” (768 - 814)",
        "Hugues Capet “le fondateur” (987 - 996)",
        "Louis IX “le saint” (1226 - 1270)",
        "Louis XIII “le juste” (1610 - 1643)",
        "Pépin le Bref (751 - 768)",
        "Charles VI “le Fol” (138 - 1422)",
        "Napoléon Ier (1804 - 1814)",
        "Louis XI “le Prudent” (1461 - 1483)",
        "Henri III (1574 - 1589)",
        "François Ier (1515 - 1547)",
        "Clotaire Ier (511 - 561)",
        "Thierry Ier (511 - 534)",
        "Louis VI “le Gros” (1081 - 1137)",
        "Clodomir (511 - 524)",
        "Childebert III “l’Adopté” (656 - 662)",
        "Chilpéric II (715 - 721)",
        "Louis XVIII (1814 - 1815)",
        "Louis-Philippe Ier “Le Roi-Citoyen” (1830 - 1848)",
        "Philippe V “le Long” (1316 - 1322)",
    ],
      "description":[
        "Fils de Childéric Ier, il conquiert la majeure partie de la Gaule et se convertit au christianisme. Son royaume est partagé entre ses quatre fils à sa mort.",
        "Fils aîné de Clotaire II. Roi associé d'Austrasie jusqu'à la mort de son père, puis roi des Francs excepté l'Aquitaine, et enfin seul roi des Francs à la mort de son frère cadet Caribert II en 632. Son royaume est partagé entre ses deux fils à sa mort.",
        "Deuxième fils de Robert II et de Constance d'Arles. Sacré à Reims le 14 mai 1027 comme roi associé.",
        "Frère cadet de Louis XVIII, il est sacré à Reims le 29 mai 1825. Confronté aux Trois Glorieuses, il abdique en faveur de son petit-fils Henri (« Henri V »), mais ce dernier n'est jamais proclamé ni reconnu.",
        "Descendant de Robert de Clermont, le dernier fils de Louis IX. Roi de Navarre depuis 1572, il devient roi de France le 2 août 1589 à la mort de son beau-frère et cousin issu de germain Henri III, qui l'a désigné comme successeur. Il abjure le protestantisme pour être sacré à Chartres le 27 février 1594. Il est assassiné par François Ravaillac le 14 mai 1610.",
        "Deuxième fils de Philippe III et d'Isabelle d'Aragon. Sacré à Reims le 6 janvier 1286. Également roi de Navarre (Philippe Ier) par son mariage avec Jeanne de Navarre.",
        "Petit-fils de Louis XV, il est sacré à Reims le 11 juin 1775. Devenu roi des Français par la constitution de 1791, il est suspendu par l'Assemblée nationale le 10 août 1792, puis déchu le 21 septembre, et guillotiné au terme de son procès, le 21 janvier 1793. Les royalistes reconnaissent son fils comme son successeur sous le nom de Louis XVII, mais celui-ci n'est jamais sacré et meurt en prison le 8 juin 1795.",
        "Fils aîné de Louis XIII et d'Anne d'Autriche, il succède à son père sous la régence de sa mère jusqu'à sa majorité, en 1651. Sacré à Reims le 7 juin 1654. Mort de la gangrène.",
        "Fils aîné de Pépin le Bref et de Bertrade de Laon. Sacré avec son père et son frère cadet Carloman en 754. Il obtient la Neustrie, la Bourgogne et l'Aquitaine à la mort de son père, puis le reste du royaume franc à la mort de son frère. Il est sacré empereur d'Occident par le pape Léon III le 25 décembre 800 à Rome.",
        "Fils d'Hugues le Grand et petit-fils de Robert Ier. Duc des Francs depuis 960, il est élu roi des Francs après la mort de Louis V au détriment du Carolingien Charles de Basse-Lotharingie. Sacré en 987, peut-être le 3 juillet à Noyon.",
        "Quatrième fils de Louis VIII et de Blanche de Castille, il succède à son père sous la régence de sa mère jusqu'à sa majorité, en 1235. Sacré à Reims le 29 novembre 1226. Mort de dysenterie devant Tunis durant la huitième croisade. Canonisé en 1297.",
        "Fils aîné d'Henri IV et de Marie de Médicis, il succède à son père à l'âge de neuf ans. Placé sous la régence de sa mère jusqu'à sa majorité, il est sacré à Reims le 17 octobre 1610. Mort de la maladie de Crohn.",
        "Devient maire du palais de Neustrie à la mort de son père Charles Martel, en 741, puis d'Austrasie après le retrait de son frère Carloman. Il dépose Childéric III et est élu roi des Francs en novembre 751. Sacré par Boniface de Mayence en 752, puis à nouveau en 754, mais cette fois-ci par le pape Étienne II et à Saint-Denis.",
        "Aîné des fils survivants de Charles V et de Jeanne de Bourbon. Sacré à Reims le 4 novembre 1380, il succède à son père sous la régence de ses oncles Louis d'Anjou, Jean de Berry, Philippe de Bourgogne et Louis de Bourbon jusqu'à ses vingt ans. La folie qui le frappe à partir de 1392 permet à ses oncles et à son frère de reprendre le pouvoir.",
        "Premier consul depuis 1799, il devient empereur des Français par la constitution du 18 mai 1804, approuvée par plébiscite le 6 novembre. Il est sacré à Notre-Dame-de-Paris le 2 décembre. Déchu par le Sénat le 3 avril 1814, il abdique le lendemain en faveur de son fils Napoléon II, puis le 6 sans conditions.",
        "Fils aîné de Charles VII et de Marie d'Anjou. Sacré à Reims le 15 août 1461.",
        "Quatrième fils d'Henri II et de Catherine de Médicis, il est élu roi de Pologne le 11 mai 1573. À la mort de son frère aîné, il rentre en France le 6 septembre 1574 et est sacré à Reims le 13 février 1575. Mort sans descendance, assassiné par Jacques Clément.",
        "Descendant de Charles V, cousin de Louis XII dont il a épousé la fille Claude de France, il inaugure la branche de Valois-Angoulême. Sacré à Reims le 25 janvier 1515. Mort de septicémie à l'âge de 52 ans.",
        "Benjamin des fils survivants de Clovis Ier et Clotilde, il hérite du royaume de Soissons. Il réunifie le royaume franc à la mort de son frère Childebert Ier en 558. Son royaume est partagé entre ses quatre fils à sa mort.",
        "Fils aîné de Clovis Ier, mais pas par Clotilde, il hérite du royaume de Reims.",
        "Fils aîné de Philippe Ier et de Berthe de Hollande. Sacré à Orléans le 3 août 1108.",
        "Aîné des fils survivants de Clovis Ier et Clotilde, il hérite du royaume d'Orléans. Tué à la bataille de Vézeronce. Ses deux premiers fils sont exécutés sur l'ordre de ses frères Childebert Ier et Clotaire Ier, mais le troisième, Clodoald, en réchappe et entre dans les ordres.",
        "Fils adoptif de Sigebert III. Roi d'Austrasie.",
        "Fils probable de Childéric II. Élu roi de Neustrie en 715, sous l'égide du maire du palais Rainfroi. Il devient roi de tous les Francs après la mort de son concurrent Clotaire IV, en 719.",
        "Frère cadet de Louis XVI, il se proclame roi le jour de la mort de son neveu Louis XVII, le 8 juin 1795. Il ne le devient effectivement que le 6 avril 1814, après l'abdication de Napoléon Ier. À l'annonce du retour de ce dernier, il s'enfuit de Paris dans la nuit du 20 mars 1815.",
        "Confronté à la révolution de 1848, il abdique en faveur de son petit-fils Philippe d'Orléans, mais l'Assemblée refuse de le reconnaître et proclame la Deuxième République.",
        "Il est le deuxième fils de Philippe IV et se voit surnommé “le Long” en référence à sa grande taille. Il est mort sans descendance.",
    ],
    "questions":[
       "A-t-il une moustache ?",
       "Est il mort assassiné ou exécuté ?",
       "A-t-il vécu à Versailles ?",
       "A-t-il régné plus de 20 ans sur la France ?",
       "Était-t-il Capétien ?",
       "S’appelait t’il Louis ?",
       "Était t’il fils de Clovis ?",
       "Est-t-il né en France ?",
       "Etait t’il Carolingien ?",
       "Etait t’il Mérovingien ?",
       "A-t-il eu plus d’une femme ?",
       "A-t’il été sacré à Reims ?",
       "Est-ce qu’il a une barbe ?",
       "Est-il mort avant ses 20 ans ?",
    ],
    "keyWords":[
      "moustache",
      "assasiné",
      "versailles",
      "20Ans",
      "capétien",
      "louis",
      "clovis",
      "france",
      "carolingien",
      "mérovingien",
      "femme",
      "reims",
      "barbe",
      "mort20Ans",
    ],
    "descriptionKeyWords":[
      "moustache 20Ans france mérovingien femme barbe",
      "moustache france mérovingien femme barbe",
      "moustache capétien france barbe",
      "versailles capétien france reims",
      "moustache 20Ans capétien france femme barbe assasiné",
      "20Ans capétien france reims",
      "assasiné versailles louis france reims",
      "versailles 20Ans louis france femme reims",
      "moustache 20Ans france carolingien femme barbe",
      "moustache capétien france reims barbe",
      "20Ans capétien louis france reims",
      "moustache 20Ans capétien louis france reims",
      "moustache france mérovingien",
      "20Ans capétien france reims",
      "france femme",
      "20Ans capétien louis france femme barbe",
      "moustache assasiné capétien france reims",
      "20Ans capétien france femme barbe",
      "moustache clovis france mérovingien femme barbe",
      "moustache 20Ans clovis france mérovingien femme barbe",
      "20Ans capétien louis france",
      "moustache clovis france mérovingien femme barbe",
      "france mérovingien mort20Ans",
      "france mérovingien",
      "versailles capétien louis france ",
      "versailles capétien louis france ",
      "capétien france femme",
    ],
    "sources":[
      "../images/clovis.svg",
      "../images/dagobert.svg",
      "../images/henriIer.svg",
      "../images/charleX.svg",
      "../images/HenriIV.svg",
      "../images/philippe4.svg",
      "../images/LouisXVI.svg",
      "../images/LouisXIV.svg",
      "../images/charlemagne.svg",
      "../images/huguescapet.svg",
      "../images/LouisIX.svg",
      "../images/LouisXIII.svg",
      "../images/pepin.svg",
      "../images/charle6.svg",
      "../images/napoleonIer.svg",
      "../images/louisXI.svg",
      "../images/henriIII.svg",
      "../images/francoisIer.svg",
      "../images/clotaire.svg",
      "../images/thierry.svg",
      "../images/LouisVI.svg",
      "../images/clodomir.svg",
      "../images/childebert.svg",
      "../images/chilperic.svg",
      "../images/LouisXVIII.svg",
      "../images/louisphilippe.svg",
      "../images/philippr5.svg"
      ],
}
/*******************MOVIES***************/
let movies = {
      "name":[
        "E.T",
        "Mary Poppins",
        "Harry Potter",
        "Blade Runner",
        "Le Parrain",
        "Forrest Gump",
        "Indiana Jones",
        "Edward aux mains d’argent",
        "Interstellar",
        "Jurassic Park",
        "Star Wars",
        "Le seigneur des anneaux",
        "Pulp Fiction",
        "Le château dans le ciel",
        "Blues Brothers",
        "Les Noces funèbres",
        "Retour vers le futur 1",
        "Charlie et la chocolaterie",
        "Alice au pays des merveilles",
        "Matrix",
        "Shining",
        "The Big Lebowski",
        "Là-haut",
        "Ghostbusters",
        "Babe, le cochon devenu berger",
        "Les gremlins",
        "Fargo",
      ],
      "description":[
        "Sorti le 11 juin 1982 par Universal Pictures, E.T. a connu un succès immédiat, dépassant La Guerre des étoiles pour devenir le film le plus rentable de tous les temps – un record qu'il a tenu pendant onze ans jusqu'à Jurassic Park, un autre film de Spielberg, qui l'a surpassé en 1993. E.T. est cependant resté le film le plus rentable des années 1980.",
        "Mary Poppins est l'ultime long métrage des studios Disney sur lequel le fondateur de la société a mis sa patte. Walt Disney a donc participé de très près au film. Il a lui-même sélectionné les acteurs Julie Andrews et Dick Van Dike. Il a également assisté à toutes les réunions d'écriture des chansons, faisant des modifications sur les textes et la mélodie. Il a par ailleurs tenu à inclure de la magie de Disney et des dessins animés pour faire un dernier pied de nez à tous les détracteurs qui critiquaient Disney pour ses films 'peu intellectuels'. Il est décédé deux ans après la sortie du film.",
        "Fin 1997 le producteur de cinéma David Heyman a reçu dans son bureau de Londres une copie du livre Harry Potter à l'école des sorciers, qui deviendrait le premier tome de la série de livres. Rangé dans l'attente d'une lecture que Heyman ne considérait pas prioritaire, le livre a été redécouvert par une secrétaire. Ce sont les conseils de cette dernière qui ont convaincu David Heyman de passer outre le « titre pourri » du livre, selon son expression. Impressionné par le travail de J. K. Rowling, il a finalement décidé de se pencher sur son adaptation au cinéma.",
        "Blade Runnern 1 est un film américain de science-fiction réalisé par Ridley Scott et sorti en 1982. Son scénario s'inspire assez librement du roman Les androïdes rêvent-ils de moutons électriques ? écrit par Philip K. Dick, à qui le film est dédié.",
        "Le parain c'est un film avec beaucoup de gangsta",
        "Tom Hanks et Robert Zemeckis négocièrent leur contrat de façon à ne toucher aucun salaire, mais un pourcentage sur les recettes du film (8 % sur les recettes brutes), gagnant ainsi 30 millions de dollars. L'auteur Winston Groom, qui négocia 3 % sur les recettes nettes, toucha 3 500 000 dollars.",
        "Indiana Jones est le nom du chien de George Lucas. Un monstre gris en blanc qu'on appelle aussi Indy. George a d'ailleurs donné à tous les personnages principaux les noms des chiens et chats de ses meilleurs amis.",
        "Le film est un succès commercial et est très bien accueilli par la critique. Il remporte plusieurs récompenses, dont le prix Hugo du meilleur film et le Saturn Award du meilleur film fantastique. Burton le considère comme son œuvre la plus personnelle. Il y développe des thèmes comme l’exclusion, la découverte de soi et la confrontation entre le fantastique et le conformisme. Le film lance la carrière de Depp et associe définitivement Burton au mouvement gothique.",
        "Nolan a fait appel au physicien spécialiste des trous noirs Kip Thorne pour simuler l'apparence visuelle d'un trou noir entouré d'un disque d'accrétion de matière en rotation rapide. Thorne a eu la possibilité de développer une simulation numérique avec un degré de précision très avancé, menant même selon le magazine américain Wired à des découvertes scientifiques.",
        "Un peu de science ! D'un point de vue plus scientifique, il faut savoir que l'idée d'extraire du sang de dinosaure à partir d'insectes fossilisés dans l'ambre, bien que très ingénieuse à première vue, est strictement... impossible. En effet, ce ne sont pas les insectes qui sont disponibles dans l'ambre mais uniquement leur empreinte en trois dimensions. Le corps des bestioles a été purement et totalement dégradé par les bactéries et les gaz piégées avec eux.",
        "En 1976, l'acteur Kenny Baker refuse, par trois fois, de jouer R2-D2. Il estime que ce rôle n'est pas assez théâtral et trop bizarre. Il ne veut pas non plus être coincé dans une boîte de conserve en mouvement. Il change d'avis au fur et à mesure qu'il découvre l'histoire et qu'il trouve le personnage sympathique.",
        "A l'origine, Elijah Wood n'avait que peu de chance de participer à l'aventure du Seigneur des anneaux : en effet, Peter Jackson souhaitait engager des comédiens britanniques pour incarner les Hobbits. L'acteur, américain, désirait tellement incarner Frodon qu'il travailla en conséquence pour modifier son accent. Et pour convaincre le réalisateur de ses qualités, il lui envoya un bout d'essai, filmé par son ami et cinéaste George Huang, dans lequel, vêtu à la Hobbit, il arpentait les collines dans la peau de Frodon. Des efforts qui portèrent leurs fruits : Peter Jackson avait trouvé son Porteur de l'Anneau.",
        "La génèse du projet Quentin Tarantino avait écrit deux des trois histoires qui composent le film, bien avant avoir rédigé les scripts de Reservoir Dogs, son premier film et True romance, mis en scène par Tony Scott. C'est suite aux succès rencontés par ces deux films qu'il à écrit le troisième volet de Pulp Fiction. Initiallement, le projet devait être réalisé par trois réalisateurs différents.",
        "En raison de la petite distribution que proposait le studio Ghibli à l'époque, puis du succès des nouveaux films (Le Voyage de Chihiro et Princesse Mononoké notamment), il n'est sorti en France qu'en 2003, soit 17 ans après sa sortie au Japon.",
        "Le film de John Landis détient le record mondial des carambolages de voitures. Il est question de 13 Bluesmobiles et de 30 à 60 voitures de police détruites durant le tournage.",
        "Les célèbres créateurs de marionnettes Ian Mackinnon et Peter Saunders ont fabriqué les personnages des Noces Funèbres à partir d'armatures métalliques, permettant de garantir leur stabilité. Tim Burton a été épaté par leurs prouesses techniques, notamment au niveau de la peau des personnages faite de mousse et de silicone. De plus, ils ont inventé un mécanisme qui, placé dans la tête des marionnettes et manipulé par diverses entrées, permet d'obtenir une plus grande variété d'expressions et de mouvements.",
        "Le PDG de Universal à l’époque, Sid Sheinberg, n’était pas d’accord avec le titre Back to the Future, insistant sur le fait que personne n’irait voir un film avec le mot « futur » dans le titre. Il a envoyé un mémo à Robert Zemeckis à ce sujet, précisant qu’il préférait que le film s’intitule Spaceman From Pluto. Steven Spielberg, qui était producteur exécutif du film, a répondu à Sheinberg qu’il avait trouvé sa blague très drôle. Le directeur de Universal, trop fier pour admettre qu’il était sérieux à Spielberg, a décidé de ne pas modifier le titre.",
        "En 2001, Tim Burton engage l'actrice Helena Bonham Carter pour jouer dans La Planète des singes. La même année, ils se marient. Depuis, le réalisateur a toujours donné un rôle d'importance à sa compagne dans ses films : dans Big fish, elle incarne une sorcière; dans Charlie et la chocolaterie, elle joue la mère de Charlie; enfin, dans Les Noces funèbres, c'est elle qui campe le personnage principal de la mariée.",
        "Une première version du script d'Alice au pays des merveilles a été écrite par Aldous Huxley L'auteur du Meilleur des Monde était même assez proche du roman de Lewis Caroll (il avait inclut Jabberwocky que Disney a jugé trop effrayant pour les enfants). Le script n'a finalement pas été retenu car il a été jugé trop intellectuel pour le public.",
        "Oeuvre dense, Matrix fait bien évidemment appel à de nombreuses références et cultures diverses. On y retrouve ainsi des éléments littéraires (le conte initiatique, Alice au Pays des merveilles), philosophiques (La Caverne de Platon, l'oeuvre de Baudrillard) et mythologiques (la thématique de l'Elu, l'Oracle...), mais également tirés des comic-books, de l'animation japonaise (Akira, Ghost in the Shell) et du jeu vidéo (le film est construit sur une série de choix : se faire arrêter ou fuir, prendre la pilule bleue ou la rouge, partir sauver Morpheus ou le laisser)... Autant d'éléments qui font de Matrix une oeuvre hybride, à la frontière du cinéma, de la bande dessinée, du conte et du jeu vidéo.",
        "Stephen King pas content L'adaptation cinématographique de Shining, roman du célèbre écrivain Stephen King, ne lui aurait pas plu. En effet, apparemment l'adaptation au grand écran de Stanley Kubrick ne serait pas assez proche du livre. Ainsi pour rectifier cela, Stephen King scénarisé et produit lui-même un remake du film pour la télévision.",
        "Le personnage campé par Jeff Bridges est largement inspiré d’un certain Jeff Dowd, producteur indépendant qu’ont rencontré les frères Coen lorsqu’ils cherchaient à faire distribuer leur premier long, Sang pour sang. Surnommé The Dude, amateur de white russians et membre des Seattle Seven issus du Seattle Liberation Front (des activistes anti-guerre du Vietnam) comme le personnage du film, qui l’évoque au détour d’une phrase, il arborait lui aussi une garde-robe plutôt décontractée, à l’image de Jeff Bridges dans le film… lequel a tapé dans sa propre garde-robe pour dénicher quelques-uns des vêtements du Dude.",
        "Le plus grand défi de l'équipe Pixar fut de faire fonctionner l'histoire. En réalité, pour élever une maison dans les airs, il faut 26,5 millions de ballons, et nous n'en avons que 20 000 raconte Pete Docter. Il ajoute qu'il faut que les gens acceptent d'y croire. Comme l'idée que Carl puisse diriger la maison à l'aide de voiles.",
        "L'idée de base de S.O.S. Fantômes est née de l'imagination de l'acteur Dan Aykroyd, l'un des héros du film. Le jeune Américain avait une ambition quelque peu folle, puisqu'à l'origine, ses chasseurs de l'espace devaient évoluer dans l'espace. Un concept jugé trop onéreux par la production. Avec son complice Harold Ramis, également l'une des vedettes du film, il retoucha le scénario et inscrit l'action à New York. S.O.S. Fantômes était né.",
        "Babe, le cochon devenu fermier, a totalisé sept nominations à l'Oscar et remporté, outre l'Oscar des Effets Visuels, le Golden Globe de la Meilleure Comédie et le trophée de la National Society of Film Critics.",
        "Le mot Mogwaï désigne les bébés Gremlins tels que Gizmo a été inventé par le scénariste du film Chris Columbus. Il s’agit d’un dérivé du terme cantonnais « móguǐ » qui peut se traduire par « démon », « esprit malin » ou « monstre ». Pour Guizmo, ce n’est pas vraiment le terme approprié, mais quand on voit ce qu’il peut devenir, on comprend mieux !",
        "Le comédien William H. Macy, après une double lecture du script, était convaincu que le rôle de Jerry Lundegaard était fait pour lui. Mais les frères Coen semblèrent ne pas voir en lui l'acteur adéquat pour incarner ce personnage puisqu'ils ne le recontactèrent pas. William H. Macy fit alors lui-même le déplacement à New York, lieu de production de Fargo et s'adressa au duo de la sorte : Je suis très, très inquiet, car vous allez gâcher ce film en donnant le rôle à quelqu'un d'autre. C'est mon rôle, et je tuerai vos chiens si vous ne me le donnez pas ! Une déclaration pleine d'humour mais également preuve d'une motivation exemplaire qui semble avoir séduit les frères Coen.",
      ],
        "questions":[
          "Est-ce que c’est un film de science fiction ?",
          "Est-ce que ce film à eu une ou plusieures suites ?",
          "Est-ce que le personnage principal est de sexe masculin ?",
          "Est-ce que c’est un dessin animé ?",
          "Est-ce un film des années 90 ?",
          "Est-ce qu’il y a des robots dans le film ?",
          "Est-ce une comédie ?",
          "Est-ce que c’est un film de Steven Spielberg ?",
          "Est-ce que Harrison Ford joue dedans ?",
          "Est-ce que le film se passe en France ?",
          "Est-ce que c’est un film récent (après année 2000) ?",
          "Est-ce que c’est un film qui a été récompensé aux Oscars ?",
          "Est-ce que ce film a rendu un acteur connu ?",
          "Est-ce que c’est un film réalisé par Tim Burton ?",
        ],
        "keyWords":[
          "sf",
          "suite",
          "masculin",
          "anime",
          "vieux",
          "robots",
          "comédie",
          "steven",
          "ford",
          "france",
          "récent",
          "oscars",
          "connu",
          "burton",
        ],
        "descriptionKeyWords":[
          "sf steven oscars",
          "comédie oscars",
          "suite masculin récent oscars connu",
          "sf suite masculin robots ford",
          "suite masculin oscars",
          "masculin vieux oscars connu",
          "suite masculin steven ford oscars",
          "masculin vieux burton",
          "sf masculin robots récent oscars",
          "masculin suite vieux steven oscars",
          "sf suite masculin robots ford oscars connu",
          "suite masculin récent oscars",
          "masculin vieux oscars connu",
          "anime récent",
          "masculin comédie",
          "masculin anime récent oscars burton",
          "sf suite masculin comédie oscars",
          "masculin comédie récent burton",
          "anime récent oscars burton",
          "sf suite masculin vieux robots oscars connu",
          "masculin",
          "masculin vieux comédie",
          "masculin anime récent oscars",
          "sf suite masculin comédie",
          "suite vieux comédie oscars",
          "suite masculin",
          "masculin vieux oscars",
        ],
        "sources":[
          "../images/E_T.svg",
          "../images/marypoppins.svg",
          "../images/harry_potter.svg",
          "../images/blade_runner.svg",
          "../images/le_parrain.svg",
          "../images/forrest_gump.svg",
          "../images/indiana_jones.svg",
          "../images/edward_argent.svg",
          "../images/interstellar.svg",
          "../images/jurassic_park.svg",
          "../images/star_wars.svg",
          "../images/seigneur_anneaux.svg",
          "../images/pulpfinction.svg",
          "../images/chateau_ciel.svg",
          "../images/blues_brothers.svg",
          "../images/noces_funebre.svg",
          "../images/retour_futur.svg",
          "../images/charlie_chocolat.svg",
          "../images/alice.svg",
          "../images/matrix.svg",
          "../images/shining.svg",
          "../images/lebewski.svg",
          "../images/la_haut.svg",
          "../images/buster.svg",
          "../images/babe.svg",
          "../images/gremlins.svg",
          "../images/fargo.svg"
        ]
}
/*******************SPORTS***************/
let sports = {
      "name":[
        "Football",
        "Basketball",
        "Tennis",
        "Natation",
        "Baseball",
        "Course à pied","Badminton",
        "Hockey sur glace",
        "Golf",
        "Boxe",
        "Ski",
        "Equitation",
        "Escrime",
        "Handball",
        "Judo",
        "Rugby à XV",
        "Volley-ball",
        "Pétanque",
        "Danse",
        "Escalade",
        "Gymnastique",
        "Karaté",
        "Patinage artistique",
        "Skateboard",
        "Tir à l’arc",
        "Lancer de javelot",
        "Cyclisme",
  ],
      "description":[
        "Le football, ou soccer, est un sport collectif qui se joue principalement au pied avec un ballon sphérique. Il oppose deux équipes de onze joueurs dans un stade, que ce soit sur un terrain gazonné ou sur un plancher.",
        "Le basket-ball ou basketball, fréquemment désigné en français par son abréviation basket, est un sport collectif opposant deux équipes de cinq joueurs sur un terrain rectangulaire.",
        "Le tennis est un sport de raquette qui oppose soit deux joueurs soit quatre joueurs qui forment deux équipes de deux.",
        "La natation, c'est-à-dire l'action de nager, est la méthode qui permet aux êtres humains et à certains animaux de se mouvoir dans l'eau sans aucune force propulsive que leur propre énergie corporelle. Parmi les activités humaines, la natation regroupe le déplacement à la surface de l'eau et sous l'eau (plongée, natation synchronisée), le plongeon et divers jeux pratiqués dans l'eau.",
        "Le baseball est un sport collectif dérivé des mêmes racines que le cricket, qui se pratique sur un terrain de gazon et de sable. Il se joue avec des battes pour frapper une balle lancée, et des gants pour rattraper la balle.",
        "La course à pied est, avec la marche, l'un des deux modes de locomotion bipèdes de l'être humain.",
        "Le badminton est un sport de raquette qui oppose soit deux joueurs ou joueuses, soit deux paires, placés dans deux demi-terrains séparés par un filet.",
        "Le hockey sur glace, appelé le plus souvent hockey, est un sport d’équipe se jouant sur une patinoire spécialement aménagée.",
        "Le golf est un sport de précision se jouant en plein air, qui consiste à envoyer une balle dans un trou à l'aide de clubs. Le but du jeu consiste à effectuer, sur un parcours défini, le moins de coups possible.",
        "La boxe anglaise, aussi appelée le noble art, est un sport de combat dans lequel deux adversaires, de même catégorie de poids et de même sexe, se rencontrent sur un ring, munis de gants rembourrés afin de limiter le risque de coupure, et s'échangent des coups de poings, portés au visage et au buste. Le combat est divisé en intervalles de temps, les rounds, séparés par une minute de repos annoncée par une cloche où le pugiliste pourra être conseillé et soigné si besoin.",
        "Le ski est un moyen de locomotion individuel de glisse pratiqué grâce à des patins longs et étroits également appelés skis, fixés aux pieds.",
        "L'équitation est la technique de la conduite du cheval sous l'action humaine. On considère l'équitation comme étant un art, un loisir ou un sport. Dans cette discipline, l'être humain a pour partenaire un équidé, le plus souvent un cheval ou un poney. Le mot vient du latin equitare, qui signifie « aller à cheval ».",
        "L’escrime est un sport de combat. Il s’agit de l’art de toucher un adversaire avec la pointe ou le tranchant d’une arme blanche sur les parties valables sans être touché. On utilise trois types d'armes : l’épée, le sabre et le fleuret.",
        "Le handball est un sport collectif joué à la main où deux équipes de sept joueurs s'affrontent avec un ballon en respectant plusieurs règles sur un terrain rectangulaire de dimensions 40 m par 20 m, séparé en deux camps.",
        "Le judo a été créé en tant que pédagogie physique, mentale et morale au japon par Jigorō Kanō en 1882. Il est généralement catégorisé comme un art martial moderne, qui a par la suite évolué en sport de combat et en sport olympique.",
        "Le rugby à XV, aussi appelé rugby union dans les pays anglophones, qui se joue par équipes de quinze joueurs sur le terrain avec des remplaçants, est la variante la plus pratiquée du rugby, famille de sports collectifs, dont les spécificités sont les mêlées et les touches, mettant aux prises deux équipes qui se disputent un ballon ovale, joué à la main et au pied.",
        "Le volley-ball, ou volley ball, est un sport collectif mettant en jeu deux équipes de six joueurs séparés par un filet, qui s'affrontent avec un ballon sur un terrain rectangulaire de 18 mètres de long sur 9 mètres de large.",
        "La pétanque est un jeu de boules dérivé du jeu provençal. C'est le dixième sport en France par le nombre de licenciés : 311 971 joueurs recensés ; il existe de nombreuses fédérations nationales affiliées à la fédération internationale.",
        "La danse est l'art de mouvoir le corps humain constitué d'une suite de mouvements ordonnés, souvent rythmés par de la musique.",
        "L’escalade, ou grimpe, parfois appelée varappe, est une pratique et un sport consistant à se déplacer le long d'une paroi pour atteindre le haut d'un relief ou d'une structure artificielle.",
        "La gymnastique est un terme générique qui regroupe aujourd'hui des formes très diverses de disciplines sportives, pratiquées pour le loisir ou la compétition.",
        "Le karaté est un art martial, dit japonais. Cependant, son origine est okinawaïenne, qui a longtemps constitué un royaume indépendant du Japon, au sud de l'île de Kyūshū.",
        "Le patinage artistique est un sport et un art exécuté sur la glace avec des patins à lames. Ce sport est particulièrement populaire en Amérique du Nord, en Europe et en Asie.",
        "Le skateboard ou skate ou la planche à roulettes est un objet composé d'une planche en bois (deck) souvent fait d'érable recouvert d'un papier adhérant aux semelles (griptape) et sous lequel sont fixés deux essieux (les trucks) maintenant chacune des roues qui sont équipées de deux roulements à billes chacune.",
        "Le tir à l'arc est un sport de précision et de concentration dans lequel les compétiteurs tentent de tirer leurs flèches au centre d'une cible avec leur arc.",
        "Le lancer du javelot est une discipline athlétique consistant à lancer un engin appelé javelot fait en métal, en fibre de verre ou en fibre de carbone.",
        "Le cyclisme recouvre plusieurs notions : il est d'abord une activité quotidienne pour beaucoup, un loisir pour d'autres (cyclotourisme), et un sport proposant des courses à bicyclette selon plusieurs disciplines : l'école de cyclisme, le cyclisme sur route, le cyclisme sur piste, le cyclo-cross, le vélo tout terrain (abrégé couramment VTT), le BMX, le cyclisme en salle et le polo-vélo. Le sport cycliste est réglementé au niveau mondial par l'Union cycliste internationale (UCI).",
      ],
      "questions":[
        "Est-ce que c'est un sport en équipe ?",
        "Est-ce que ce sport se joue avec une balle/boule ?",
        "Est-ce que ce sport nécessite des protections corporels pour le pratiquer ?",
        "Est-ce que ce sport a été inventé en angleterre ?",
        "Est-ce que ce sport a été inventé en français ?",
        "Est-ce que c'est un des 8 sports les plus pratiqués en France ?",
        "Est-ce que c'est un sport où le dopage est le plus répandu ?",
        "Est-ce que ce jeu fait partie des Jeux Olympiques d'été ?",
        "Est-ce que ce sport fait partie des sports les plus anciens du monde ?",
        "Est-ce que ce sport est dangereux ?",
        "Est-ce que c'est un sport de combat ?",
        "Est-ce que ce sport dit 'de glisse'?",
        "Est-ce que c'est un sport que l'on pratique dans des conditions basses températures ?",
        "Est-ce que c'est un sport qui coûte cher à être pratiqué ?",
      ],
      "keyWords":[
        "équipe",
        "balle",
        "protec",
        "angleterre",
        "france",
        "plus",
        "dopage",
        "jo",
        "anciens",
        "dangereux",
        "combat",
        "glisse",
        "froid",
        "cher",
      ],
      "descriptionKeyWords":[
        "équipe angleterre plus dopage jo",
        "équipe plus jo",
        "balle angleterre plus jo",
        "dopage jo anciens",
        "balle dopage jo",
        "dopage jo anciens",
        "angleterre jo",
        "équipe protec jo anciens froid",
        "balle plus jo cher",
        "protec angleterre jo dangereux combat",
        "dangereux glisse froid",
        "plus jo dangereux cher",
        "france protec jo combat",
        "plus équipe jo",
        "plus jo combat",
        "équipe protec angleterre plus dopage dangereux",
        "équipe jo",
        "balle france",
        "protec",
        "dangereux",
        "jo",
        "protec combat",
        "protec jo glisse",
        "protec jo glisse",
        "jo anciens",
        "jo anciens",
        "protec france dopage jo"
      ],
      "sources":[
        "../images/foot.svg",
        "../images/basket.svg",
        "../images/tennis.svg",
        "../images/natation.svg",
        "../images/baseball.svg",
        "../images/running.svg",
        "../images/badminton.svg",
        "../images/hockey.svg",
        "../images/golf.svg",
        "../images/boxe.svg",
        "../images/ski.svg",
        "../images/horse.svg",
        "../images/escrime.svg",
        "../images/hand.svg",
        "../images/judo.svg",
        "../images/rugby.svg",
        "../images/volley.svg",
        "../images/petanque.svg",
        "../images/danse.svg",
        "../images/escalade.svg",
        "../images/gymnast.svg",
        "../images/karate.svg",
        "../images/patinage_glace.svg",
        "../images/skate.svg",
        "../images/tir_a_arc.svg",
        "../images/javelot.svg",
        "../images/velo.svg"
      ]
}
/*******************PAYS***************/

let countries = {
      "name":[
        "Afrique du Sud",
        "Algérie",
        "Allemagne",
        "Arménie",
        "Brésil",
        "France",
        "Royaume-Uni",
        "Espagne",
        "Canada",
        "Argentine",
        "Australie",
        "Cuba",
        "Corée du Sud",
        "Japon",
        "Russie",
        "Pays-Bas",
        "Nigéria",
        "Etats-Unis",
        "Chine",
        "Corée du Nord",
        "Inde",
        "Colombie",
        "Irlande",
        "Maroc",
        "Mexique",
        "Israël",
        "Italie"
    ],
      "description":[
        "L'Afrique du Sud, en forme longue la République d'Afrique du Sud, est un pays situé à l'extrémité australe du continent africain. Sa capitale administrative est Pretoria. Il est frontalier au nord avec la Namibie, le Botswana et le Zimbabwe, et au nord-est avec le Mozambique et le Swaziland. Le Lesotho est pour sa part un État enclavé dans le territoire sud-africain.",
        "L'Algérie est un pays nord-africain doté d'un littoral sur la mer Méditerranée et d'un intérieur désertique, le Sahara. De nombreux empires y ont laissé leur marque, comme les anciennes ruines romaines de Tipasa, en bord de mer. Dans la capitale, Alger, des sites ottomans, tels que la mosquée Ketchaoua, datant de 1612 environ, bordent le quartier de la Casbah. Perché sur une colline, cet endroit dispose d'allées étroites et d'escaliers. La basilique Notre-Dame d'Afrique, arborant une architecture néo-byzantine, date de la domination coloniale française.",
        "L’allemagne est un pays fédérale membre de l’union européenne et qui fut un temps été coupé en deux : RDA et RFA. C’est un des grands exportateurs de l’europe et le pays est aussi un leader en terme de marché automobile.",
        "L’Arménie est un pays situé dans la région du Petit Caucase en Asie occidentale. Cette ancienne république socialiste soviétique a des frontières terrestres avec la Turquie à l'ouest, la Géorgie au nord, l'Azerbaïdjan à l'est et l'Iran au sud. Bien que géographiquement située en Asie, l'Arménie est considérée comme faisant culturellement, historiquement et politiquement parlant, partie de l'Europe, voire, géographiquement, à sa lisière. Le pays est d'ailleurs considéré comme un berceau du christianisme et des civilisations indo-européennes.",
        "Le Brésil, vaste pays d'Amérique du Sud, s'étend du bassin amazonien au nord à des vignobles et aux chutes d'Iguaçu au sud. La ville de Rio de Janeiro, caractérisée par sa statue du Christ Rédempteur de 38 mètres de haut située au sommet du Corcovado, est réputée pour ses plages très fréquentées de Copacabana et d'Ipanema",
        "La France, pays de l'Europe occidentale, compte des villes médiévales, des villages alpins et des plages. Paris, sa capitale, est célèbre pour ses maisons de mode, ses musées d'art classique, dont celui du Louvre, et ses monuments comme la Tour Eiffel.",
        "Le Royaume-Uni, composé de l'Angleterre, de l'Écosse, du Pays de Galles et de l'Irlande du Nord, est un pays insulaire au nord-ouest de l'Europe. L'Angleterre, berceau de Shakespeare et des Beatles, comprend Londres comme capitale, centre financier et culturel à l'influence mondiale. Elle offre également les cercles de pierres de Stonehenge, les thermes romains de Bath et les universités vieilles de plusieurs siècles d'Oxford et de Cambridge.",
        "L'Espagne est un pays européen situé sur la péninsule ibérique et comprenant 17 régions autonomes à la géographie et aux cultures diverses. Madrid, la capitale, abrite le palais royal et le musée du Prado, où sont exposées les œuvres d'artistes européens. On peut admirer à Ségovie un château médiéval (l'Alcazar) et un aqueduc romain intact. La capitale de la Catalogne, Barcelone, se caractérise par les monuments modernistes d'Antoni Gaudí, notamment la Sagrada Família.",
        "Le Canada est un pays nord-américain situé entre les États-Unis au sud et le cercle polaire au nord. Les principales villes sont Toronto, Vancouver, centre du cinéma de la côte ouest, Montréal et Québec, toutes deux francophones, et Ottawa, la capitale. Le Canada compte, parmi ses vastes étendues sauvages, le parc national de Banff avec ses nombreux lacs situé dans les montagnes Rocheuses. Il abrite également les célèbres et majestueuses chutes du Niagara.",
        "L'Argentine est un grand pays d'Amérique du Sud au relief très varié où se côtoient les montagnes des Andes, les lacs glaciaires et la pampa, de grandes plaines de pâturage où paissent les célèbres bovins du pays. L'Argentine est réputée pour le tango et la musique. Au centre de Buenos Aires, la grande capitale cosmopolite, se trouve la place de Mai, bordée de bâtiments datant du XIXe siècle tels que la Casa Rosada (Maison rose), le palais présidentiel à balcon.",
        "L'Australie est un pays et continent entouré par les océans Indien et Pacifique. Ses principales villes, Sydney, Brisbane, Melbourne, Perth et Adélaïde, sont bâties sur la côte. La capitale, Canberra, est quant à elle située à l'intérieur des terres. Le pays est connu pour l'opéra de Sydney, la Grande Barrière de corail, ses grandes étendues sauvages et désertiques appelées l'Outback, et ses espèces animales uniques comme le kangourou et l'ornithorynque.",
        "Cuba est un État insulaire communiste des Caraïbes. On y trouve des plages de sable spectaculaires et des champs de tabac pour la production des cigares légendaires. La capitale, La Havane, est riche de maisons aux façades pastel, de voitures des années 1950 et d'une architecture hispano-coloniale du XVIe siècle dans la vieille Havane. On peut écouter de la salsa dans des clubs de danse et assister à des spectacles de cabaret au célèbre Tropicana.",
        "La Corée du Sud, un pays d'Asie de l'Est, occupe la moitié sud de la péninsule de Corée. Elle partage l'une des frontières les plus fortement militarisées du monde avec la Corée du Nord. Elle est également connue pour sa campagne vallonnée et verdoyante parsemée de cerisiers et de temples bouddhistes datant de plusieurs siècles, ainsi que pour les villages de pêcheurs de sa côte, ses îles subtropicales et ses villes high-tech comme Séoul, sa capitale.",
        "Le Japon est un pays insulaire situé dans l'océan Pacifique. Il comporte des villes denses, des palais impériaux, des parcs nationaux montagneux ainsi que des milliers de temples et de sanctuaires. Les trains à grande vitesse Shinkansen reliant les îles principales de Kyūshū (avec les plages subtropicales d'Okinawa), Honshū (où se trouvent Tokyo et le mémorial en hommage aux victimes du bombardement atomique d'Hiroshima) et Hokkaidō (prisée pour le ski). Tokyo, la capitale, est réputée pour ses gratte-ciel, ses magasins et sa culture populaire.",
        "La Russie, la plus grande nation au monde, est frontalière de pays européens et asiatiques, ainsi que des océans Pacifique et Arctique. Ses paysages varient de la toundra aux plages subtropicales en passant par la forêt. Le pays est célèbre pour les compagnies de danse classique du Bolchoï à Moscou et du Mariinsky à Saint-Pétersbourg. Fondée par le tsar russe Pierre le Grand, la ville de Saint-Pétersbourg compte un palais d'hiver baroque, qui abrite désormais une partie des collections du musée de l'Ermitage.",
        "Les Pays-Bas, en forme longue le Royaume des Pays-Bas, sont un pays d'Europe de l'Ouest, frontalier avec la Belgique au sud et l'Allemagne à l'est, possédant également une frontière avec la France sur l'île de Saint-Martin.",
        "Le Nigeria, un pays africain du golfe de Guinée, possède un grand nombre de réserves et sites naturels. Les zones de conservation comme les parcs nationaux de Cross River et de Yankari comportent des chutes d'eau, une forêt tropicale dense, des savanes et des habitats abritant des primates rares. L'un des sites les plus notables est Zuma Rock, un monolithe de 725 m de haut à la sortie de la capitale Abuja. Il est représenté sur la monnaie du pays.",
        "Les États-Unis sont un pays constitué de 50 états et couvrant une vaste portion de l'Amérique du Nord, avec l'Alaska au nord-ouest et Hawaï étendant la présence du pays dans l'océan Pacifique. Les principales villes de la côte atlantique sont New York, centre international financier et culturel, et Washington, la capitale. Dans la région du Midwest, la métropole de Chicago est connue pour son architecture influente et sur la côte ouest, le quartier d'Hollywood à Los Angeles est célèbre pour ses studios de cinéma.",
        "La Chine est un pays très peuplé d’Asie de l’est. Son territoire immense présente des paysages variés : prairies, déserts, montagnes, lacs, rivières et plus de 14 000 km de littoral. Pékin, la capitale à l’architecture moderne, conserve également des sites historiques, comme le palais de la Cité interdite et la place Tian Anmen. Shanghaï est l'un des plus grands centres financiers mondiaux et comporte de nombreux gratte-ciels. L’emblématique Grande Muraille de Chine partage le nord du pays d’est en ouest.",
        "La Corée du Nord, officiellement la République populaire démocratique de Corée, est un État qui couvre la partie nord de la péninsule coréenne située en Asie orientale. Comptant 24,9 millions d'habitants en 2015, sa capitale est Pyongyang.",
        "Immense pays du sud de l'Asie, l'Inde offre un paysage varié, des pics de l'Himalaya au littoral de l'océan Indien. Son histoire remonte à 5 millénaires. Au nord se trouvent des sites datant de l'empire moghol tels que le Fort rouge et l'imposante mosquée Jama Masjid, à Delhi, ainsi que l'emblématique mausolée du Tāj Mahal, à Agra. Les pèlerins viennent faire leurs ablutions dans les eaux du Gange, à Bénarès. Rishikesh est la capitale du yoga, mais aussi le point de départ des randonnées vers l'Himalaya.",
        "La Colombie est un pays situé dans l’extrême nord du continent sud-américain. Son territoire est composé de forêts tropicales, de la cordillère des Andes et d’une multitude de plantations de café. À Bogotá, sa capitale perchée à plus de 2 600 m d’altitude, le quartier de Zona Rosa a établi sa réputation grâce à ses nombreux restaurants et magasins. Carthagène des Indes, sur la côte caribéenne, abrite une vieille ville coloniale entourée de remparts, un château du XVIe siècle et des récifs coralliens.",
        "La République d'Irlande occupe la majeure partie de l'île au large des côtes de l'Angleterre et du Pays de Galles. Sa capitale, Dublin, est la ville natale d'écrivains comme Oscar Wilde, et de la Guinness. Le Livre de Kells, datant du IXe siècle, de même que d'autres manuscrits enluminés sont conservés à la bibliothèque du Trinity College. Surnommée l'île d'émeraude en raison de son paysage luxuriant, le pays est parsemé de châteaux médiévaux comme le château de Cahir.",
        "Le Maroc, pays d'Afrique du Nord sur le littoral de l'Atlantique et de la Méditerranée, se distingue par ses influences berbères, arabes et européennes. La médina de Marrakech, quartier médiéval aux allures de labyrinthe, est un lieu animé, avec sa place Jemaa el-Fna et ses souks (marchés) vendant des céramiques, des bijoux et des lanternes en métal. La casbah des Oudayas à Rabat, la capitale, est un fort royal du XIIe siècle qui surplombe l'océan.",
        "Situé entre les États-Unis et l'Amérique centrale, le Mexique est un pays réputé pour ses plages du Pacifique et du golfe du Mexique, ainsi que pour ses paysages variés - entre montagnes, déserts et jungles. Il est pourvu de ruines anciennes comme Teotihuacan et la cité maya de Chichén Itzá ainsi que de villes datant de l'époque coloniale espagnole. Sa capitale Mexico propose un retour à la modernité avec ses boutiques haut de gamme, ses musées renommés et ses restaurants gastronomiques.",
        "Israël est un pays du Moyen-Orient qui borde la mer Méditerranée. Pour les Juifs, les Chrétiens et les Musulmans, c'est la Terre sainte. Ses sites les plus sacrés se trouvent à Jérusalem, dont la vieille ville inclut le mont du Temple, avec le sanctuaire du dôme du Rocher, le célèbre Mur des Lamentations, la mosquée al-Aqsa et l'église du Saint-Sépulcre. Tel Aviv, le centre financier d'Israël, est renommée pour ses plages et son architecture Bauhaus.",
        "L'Italie, pays européen bordé par la Méditerranée et l'Adriatique, a laissé une forte empreinte sur la culture et la cuisine occidentales. Sa capitale, Rome, abrite le Vatican ainsi que des trésors artistiques et des ruines antiques. Les autres grandes villes comprennent Florence, avec des chefs-d'œuvre de la Renaissance comme le David de Michel-Ange et le dôme de Brunelleschi, Venise, la ville des canaux, et Milan, la capitale italienne de la mode.",
          ],
            "questions":[
              "Est-ce que c'est un pays qui possède plus de 40 millions d'habitant ?",
              "Est-ce que c'est un pays qui fait plus de 1 million de km² ?",
              "Est-ce que c'est un pays anglophone ?",
              "Est-ce que c'est un pays qui est en Europe ?",
              "Est-ce que c'est un État autoritaire ?",
              "Est-ce que le drapeau du pays contient du bleu ?",
              "Est-ce que ce pays fait parti des 10 pays les plus riches du monde ?",
              "Est-ce qu’il y a un dessin sur le drapeau du pays ?",
              "Est-ce que c’est un des pays les plus touristique ?",
              "Est-ce que le pays est un participant à l’eurovision ?",
              "Est-ce que ce pays fait parti du continent Africain ?",
              "Est-ce que c’est un pays qui possède un désert ?",
              "Est-ce que ce pays possède une des nouvelles merveilles du monde ?", "Est ce que le drapeau du pays contient du rouge ?"
            ],
            "keyWords":[
              "quarante",
              "million",
              "anglophone",
              "europe",
              "autoritaire",
              "bleu",
              "riche",
              "dessin",
              "tourisme",
              "eurovision",
              "afrique",
              "désert",
              "merveilles",
              "rouge",
            ],
            "descriptionKeyWords":[
              "million bleu afrique désert rouge",
              "dessin afrique désert rouge",
              "quarante europe riche tourisme eurovision rouge",
              "bleu eurovision rouge",
              "quarante million bleu riche dessin merveilles",
              "quarante europe bleu riche tourisme eurovision rouge",
              "anglophone europe bleu riche tourisme eurovision rouge",
              "quarante europe dessin tourisme eurovision rouge",
              "million anglophone riche bleu désert rouge",
              "quarante bleu dessin désert",
              "million bleu eurovision désert rouge",
              "autoritaire bleu rouge",
              "quarante bleu dessin rouge",
              "riche rouge",
              "autoritaire bleu tourisme eurovision rouge",
              "europe bleu eurovision rouge",
              "afrique",
              "quarante million anglophone bleu riche tourisme désert rouge",
              "quarante million autoritaire riche dessin tourisme désert merveilles rouge",
              "autoritaire rouge",
              "quarante million bleu riche dessin désert merveilles",
              "quarante million bleu rouge",
              "anglophone eurovision",
              "dessin eurovision afrique désert rouge",
              "quarante million dessin tourisme désert merveilles rouge",
              "bleu dessin eurovision",
              "quarante europe riche tourisme eurovision merveilles rouge",
              ],
              "sources":[
                 "../images/afrique_sud.svg",
                 "../images/algerie.svg",
                 "../images/allemagne.svg",
                 "../images/armenie.svg",
                 "../images/bresil.svg",
                 "../images/france.svg",
                 "../images/uk.svg",
                 "../images/espagne.svg",
                 "../images/canada.svg",
                 "../images/argentine.svg",
                 "../images/australie.svg",
                 "../images/cuba.svg",
                 "../images/coree_sud.svg",
                 "../images/japon.svg",
                 "../images/russie.svg",
                 "../images/pays_bas.svg",
                 "../images/nigeria.svg",
                 "../images/usa.svg",
                 "../images/chine.svg",
                 "../images/coree_nord.svg",
                 "../images/inde.svg",
                 "../images/colombie.svg",
                 "../images/ireland.svg",
                 "../images/maroc.svg",
                 "../images/mexique.svg",
                 "../images/israel.svg",
                 "../images/italie.svg"
              ],
        }
